In [1]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Seattle']
}

df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45      Seattle

In [2]:
mask = df['Age'] > 30
mask

0    False
1    False
2     True
3     True
4     True
Name: Age, dtype: bool

In [3]:
filtered_df = df[mask]
filtered_df

      Name  Age     City
2  Charlie   35  Chicago
3    David   40  Houston
4      Eva   45  Seattle

In [4]:
mask = (df['Age'] > 30) & (df['City'] != 'Houston')
filtered_df = df[mask]
filtered_df

      Name  Age     City
2  Charlie   35  Chicago
4      Eva   45  Seattle

In [5]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45      Seattle

In [6]:
filtered_df = df[df['Age'].between(30, 40)]

In [7]:
filtered_df

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [8]:
mask = df['City'].isin(['Chicago', 'Houston'])
filtered_df = df[mask]
filtered_df

      Name  Age     City
2  Charlie   35  Chicago
3    David   40  Houston